cantilever/fluid-openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1122;
        startFace       2157;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1122;
        startFace       3279;
    }
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       4401;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       4426;
    }
    flap
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          32;
        startFace       4451;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          46;
        startFace       4483;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          46;
        startFace       4529;
    }
)

// ************************************************************************* //
